Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་འོད་འཚེར་ཞིང་གསལ་ལ་རྣམ་པར་དག་པས་བླ་ནས་བཀབ་པ།
en: It was pure and bright, shining with Jambu River gold.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་སྤ་བརསྤེལ་བས་སྤྲས་པའི་གསེར་གྱི་དྲ་བས་ནང་ཤུན་གྱི་རྒྱན་བྱས་པ་མུ་ཏིག་སྣ་ཚོགས་ཀྱི་སེ་མོ་དོ་མངོན་པར་སྦྱངས་པ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲ་བས་ཀུན་ནས་བཀབ་པ།
en: It was adorned by an inner layer of lines of various jewels on a network of gold strings. It was hung with strings of various pearls. It was covered with a net of various jewels.

source: རིན་པོ་ཆེའི་དྲིལ་བུའི་དྲ་བ་ལས་གསེར་རིན་པོ་ཆེའི་དྲིལ་ཆེན་རིན་པོ་ཆེའི་ཆུན་པོའི་ལྡ་ལྡི་ལ་བརྒྱུས་པ་མངོན་པར་སྦྱངས་པ།
en: It had a net of precious little bells and large precious golden bells strung along strings in clusters.

source: ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་ཕྲེང་བ་ཀུན་ནས་མངོན་པར་སྤྱངས་པའི་རྒྱན་དང་ལྡན་པ།
en: It was adorned by being hung with strings of excellent, precious jewels.

source: ལྷ་རྫས་ཀྱི་སྒྲ་ཡིད་དུ་འོང་བའི་གདངས་གྲགས་པར་འབྱུང་བ། སེམས་ཅན་ཐམས་ཅད་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་བསྐུལ་བའི་དྲིལ་གྱི་སྒྲ་རྣམ་པར་གྲག་པ་བྱུང་བར་གྱུར་ཏེ།
en: It emitted divine, beautiful sounds, and the sounds of the ringing bells inspired all beings to the path of good actions.

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེ། རིན་པོ་ཆེའི་རྡུལ་ཡབ་ཀྱིས་མངོན་པར་གཡོབ་ཅིང་།
en: “King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa was being fanned with precious yak-tail fans.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་པས་ཀྱང་ལྷག་པར་གཟི་བརྗིད་རབ་ཏུ་འབར་བས་ཤིན་ཏུ་མཛེས་སོ།
en: He was beautiful, shining with a majesty that surpassed that of Śakra, the lord of the devas.

source: དེ་སེང་གེའི་ཁྲི་དེ་ལ་འདུག་མ་ཐག་ཏུ་འགྲོ་བའི་མང་པོ་དེ་དག་ཐམས་ཅད་མངོན་དུ་གྱུར་ཏེ། ཐལ་མོ་སྦྱར་ནས་རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “As soon as he was seated upon the lion throne, many beings stood before him with palms together in homage.

source: དེ་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེའི་དྲུང་དུ་སློང་བའི་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྣ་ཚོགས་དངོས་པོ་སྣ་ཚོགས་ཡོངས་སུ་ལེན་པ་ཡོ་བྱད་སྣ་ཚོགས་ལ་མོས་པ། རིགས་སྣ་ཚོགས་དང་ལྡན་པ། འགྲོ་བའི་རྒྱུད་སྣ་ཚོགས་སུ་གཏོགས་པ། འདོད་པ་སྣ་ཚོགས་ཀྱི་སེམས་དང་ལྡན་པ། སྨོན་པ་དང་བསམ་པ་སྣ་ཚོགས་ཅན། ཕྱོགས་སྣ་ཚོགས་ནས་འདུས་པ། ཡུལ་གྱི་སྤྱོད་པ་སྣ་ཚོགས་ལ་གནས་པ། ལོངས་སྤྱོད་སྣ་ཚོགས་ལ་མངོན་པར་སྨོན་པའི་སེམས་དང་ལྡན་པ།
en: “The quintillion beings standing before King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa wished to obtain various necessities and various things.

source: བསམ་པ་དང་ཡོངས་སུ་རྟོག་པ་སྣ་ཚོགས་ཅན། མིའི་རིས་སྣ་ཚོགས་སུ་གཏོགས་པ། རིགས་ཀྱི་སྐྱེ་གནས་སྣ་ཚོགས་སུ་སྐྱེས་པ། ཡུལ་སྣ་ཚོགས་ནས་འོངས་པ། སྒྲ་སྐད་དང་ཚིག་གི་འདུ་བྱེད་སྣ་ཚོགས་དང་ལྡན་པ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་འབྱིན་པ་དངོས་པོ་སྣ་ཚོགས་ཀྱི་དོན་དུ་གསོལ་བ་འདེབས་པ།
en: They came from various families, they were various kinds of beings, they had minds with various desires, they had various aspirations and wishes, they had gathered from various regions, they were accustomed to various ranges of enjoyments, they had minds that aspired for various kinds of enjoyment, they had various kinds of intentions and ideas, they were from various classes of humans, they had been born into various families, they had come from various lands, they spoke various languages and with various vocabularies, they gave rise to various fields of speech, they supplicated for various things, and they spoke in various words and voices.

source: ཚིག་དང་ངག་སྣ་ཚོགས་བརྗོད་པ། བསོད་ནམས་ཀྱི་རི་རབ་ཆེན་པོ་དེ་འབའ་ཤིག་གི་གདོང་དུ་ལྟ་བ་འདི་འབའ་ཤིག་ཤེས་པའི་སྐྱེས་བུ་ཆེན་པོ་ཡིན་ཞེས་ངེས་པར་སེམས་པ།
en: “They all thought with certainty, ‘This great Sumeru of merit that we are looking at—he alone is a great man of wisdom.’

source: བསོད་ནམས་ཆེན་པོས་བརྟན་པའོ། །སྐྱེས་བུ་ཆེན་པོའི་ཟླ་བའོ། །གཏོང་བ་ཆེན་པོའི་བསམ་པ་དང་ལྡན་པའོ། །ཞེས་བྱ་བར་འདུན་པའི་སེམས་ཀྱིས་རྟོག་པ།
en: “In expectation they thought, ‘He is supported by great merit, he is a moon that is a great man, and he intends to perform a great act of generosity.’

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སེམས་ཀྱིས་འདུས་པ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སེམས་ཀྱིས་སྤྲུལ་པའི་སློངས་མོ་བའི་ཚོགས་ཆེན་པོ་དེ་མཐོང་ནས། སློངས་མོ་བ་དེ་དག་ལ་སེམས་དགའ་བ་དང་སེམས་མོས་པ་དང་།
en: “When he saw the great gathering of supplicants who had been gathered by a mind with the aspiration of a bodhisattva, who had been manifested by a mind with the aspiration of a bodhisattva, he felt in his mind affection, delight, and benevolence toward them.

source: སེམས་སྤྲོ་བ་དང་དགེ་བའི་བཤེས་གཉེན་མཐོང་བའི་འདུ་ཤེས་སུ་གྱུར་ཏོ། །
en: He perceived them to be his kalyāṇamitras.

source: སྙིང་རྗེ་ཆེན་པོའི་ཤུགས་དྲག་པོ་ཤིན་ཏུ་ཡངས་པ་ཡང་བྱུང་བར་གྱུར་ཏོ། །
en: There arose in him a vast and powerful great compassion.

source: ཕྱི་མའི་མཐའི་བསྐལ་པར་སློངས་མོ་བ་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱ་བ་ལས་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་དྲག་པོ་ཡང་སྐྱེས་པར་གྱུར་ཏོ། །
en: He also developed the powerful diligence that would never turn back from satisfying all supplicants throughout future kalpas.

source: འགྲོ་བ་ཐམས་ཅད་དུ་སྙོམས་པའི་སྦྱོར་བས་ཡོངས་སུ་གཏོང་བའི་སེམས་ཀྱིས་རྒྱས་པར་དགང་བའི་སྤྲིན་ཀྱང་མངོན་པར་བྱུང་བར་གྱུར་ཏེ།
en: There also arose all-pervading clouds of the aspiration to be equally engaged in generosity toward all beings.

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེས། སློངས་མོ་བ་དེ་དག་མཐོང་བའི་མོད་ལ་དེའི་རྒྱུས་ཆེས་དགའ་བར་གྱུར་གྱིས། བསྐལ་པས་མཚམས་མེད་པའི་མཐས་ཀླས་པར་སྟོང་གསུམ་གྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་མཐས་ཀླས་པར་བརྒྱ་བྱིན་གྱི་དབང་ལ་གནས་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་མཐས་ཀླས་པར་རབ་མཚེ་མའི་ལྷའི་རྒྱལ་པོའི་དབང་ལ་གནས་པ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོའི་མཐས་ཀླས་པར་རབ་དགའ་ལྡན་གྱི་ལྷའི་རྒྱལ་པོའི་དབང་ལ་གནས་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་ཚད་མེད་པའི་མཐསཀླས་པར་རབ་འཕྲུལ་དགའི་ལྷའི་རྒྱལ་པོའི་དབང་ཕྱུག་གི་དབང་ལ་གནས་པ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐས་ཀླས་པར་དབང་བསྒྱུར་གྱི་ལྷའི་རྒྱལ་པོའི་དབང་རབ་ཏུ་ཐོབ་སྟེ། ལྷའི་བུ་མོ་བཞིན་བཟང་མོ་ཡིད་དུ་འོང་བས་བསྙེན་བཀུར་བས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་བརྗོད་དུ་མེད་པའི་མཐས་ཀླས་པར་ཚངས་པའི་ཐབས་ལ་གནས་པ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་པ་མཐའ་ཡས་པའི་མཐས་ཀླས་པར་གྱ་ནོམ་སྣང་བའི་ལྷའི་བདེ་བ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་དཔག་ཏུ་མེད་ཅིང་མི་ཟད་པར་དགེ་རྒྱས་ཀྱི་ལྷའི་བདེ་བ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །བསྐལ་བ་མུ་མེད་པའི་མཐས་ཀླས་པར་གནས་གཙང་མའི་ལྷའི་རྣམ་པར་ཐར་པ་ཞི་བའི་བདེ་བ་ལ་རྣམ་པར་སྤྱོད་པ་ཐོབ་པས་ནི་མ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྲེད་པ་ལ་སྤྱོད་པ། ཕ་མ་དང་ཕུ་ནུ་དང་།
en: “As soon as King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa saw those supplicants, it caused him to experience a joy greater than attaining the sovereignty of a cakravartin king of a billion-world universe for endless kalpas; a joy greater than attaining the throne of the sovereignty of Śakra for many quintillions of kalpas; a joy greater than attaining the throne of the sovereignty of the lord of devas, Suyāma, for many quintillions of kalpas; a joy greater than attaining the throne of the sovereignty of the lord of devas, Saṃtuṣita, for many quintillions of kalpas; a joy greater than attaining the throne of the sovereignty of the lord of devas, Sunirmita, for endless kalpas; a joy greater than attaining the throne of the sovereignty of the lord of devas, Vaśavartin, and being honored by beautiful, delightful apsarases for countless kalpas; a joy greater than attaining the throne of Brahmā and enjoying the bliss of dwelling in the Brahmā paradise for endless kalpas; a joy greater than attaining the bliss of the Ābhāsvara devas for endless kalpas; a joy greater than attaining the bliss of the Śubhakṛtsna devas for an unceasing, unequaled number of kalpas; and a joy greater than attaining the bliss of peaceful liberation of the Śuddhāvāsa devas for kalpas without end.

source: བུ་སྲིང་དང་མཛའ་བོ་དང་། བློན་པོ་དང་། གཉེན་བཤེས་དང་། བུ་དང་བུ་མོ་དང་ཆུང་མ་དང་། ཡུན་རིང་པོ་ཞིག་ཏུ་བྲལ་ལ་འབྲོག་དགོན་པར་འཁྱམས་ཏེ།
en: “Noble one, it was like a solitary man, filled with longing, who has been separated for a long time from his father, mother, brothers, sisters, friends, relatives, sons, daughters, and wife and is wandering in a wilderness.

source: དེ་དག་མཐོང་བར་འདོད་འདོད་པ་ལས་དེ་དག་དང་ཕྲད་ན་དེ་དག་མཐོང་བས་མི་ངོམས་ཤིང་། དགའ་བ་དང་ཆགས་པ་ཆེན་པོ་སྐྱེ་བར་འགྱུར་རོ། །
en: He longs and longs to see them, and when he meets them he never has enough of looking at them, and a great joy and affection arises within him.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས། སློངས་མོ་པ་དེ་དག་མཐོང་བར་གྱུར་པའི་མོད་ལ་དགའ་བའི་ཤུགས་ཆེན་པོ་སྐྱེས་སོ། །
en: “Noble one, in the same way, the instant King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa saw those supplicants, a great powerful joy arose in him.

source: སེམས་ཀྱི་དགའ་བའི་རོ་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: His mind was overpowered by bliss and happiness.

source: སེམས་སྤྲོ་བའི་ཤུགས་རབ་ཏུ་བྱུང་ངོ་། །
en: He experienced an intensely powerful delight.

source: རབ་ཏུ་དགའ་བ་ཆེན་པོའི་ཤུགས་ཡོངས་སུ་སྐྱེས་སོ། །
en: The power of a great joy arose in him.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་དད་པ་དང་། མོས་པའི་ཤུགས་ཀྱི་སྟོབས་ཆེན་པོ་འཕེལ་ཏོ། །
en: The great strength of the power of faith in and aspiration for the enlightenment of buddhahood increased.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་རྩ་བ་བརྟན་པའི་དད་པ་རྣམ་པར་འཕེལ་ཏོ། །
en: The heartfelt faith in omniscience increased.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ལ་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་སྟོབས་མངོན་པར་འཕེལ་ཏོ། །
en: The strength of his pure, superior aspiration for the Dharma of all the buddhas increased.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ལས་སུ་རུང་བ་ཡོངས་སུ་བྱུང་ངོ་། །
en: He became capable of attaining the powers of a bodhisattva.

source: སེམས་དགའ་བས་རྒྱས་པས་མོས་པའི་ཤུགས་ཆེན་པོ་སྐྱེས་པར་གྱུར་ཏོ། །
en: There arose the great power of aspiration through his mind being pervaded with joy.

source: སེམས་སྤྲོ་བའི་ཤུགས་ཡངས་པས་དགེ་བའི་བཤེས་གཉེན་ལ་དབང་པོ་དང་། བསམ་པ་ཤིན་ཏུ་གུས་པར་གྱུར་ཏོ། །
en: Through the vast power of his rapture, he became deeply reverential in faculties and thoughts toward kalyāṇamitras.

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དམིགས་པ་ལ་བརྩོན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་གཞོལ་བ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་དང་སྒོ་ལ་མངོན་དུ་བལྟས་པ། འགྲོ་བ་ཐམས་ཅད་ཤིན་ཏུ་ཚིམ་པར་བྱས་པའི་ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་འཇུག་པའི་ནན་ཏན་ལ་འདུན་པ། བདུད་དང་ལས་དང་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་འཐོར་བ་ལ་བརྩོན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གདམས་ངག་མཐུན་པར་བླང་བ་ལ་སྟ་གོན་དུ་གནས་པ། དགེ་བའི་རྩ་བ་རྒྱ་མཚོ་ཀུན་ནས། ཡོངས་སུ་བསྡུ་བ་ལ་བརྩོན་པའི་སྙིང་པོ་ཅན། མངོན་པར་ཞེན་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་རྒྱུད་དང་ལྡན་པ། འཇིག་རྟེན་གྱི་ཡུལ་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པ། ཆོས་ཀྱི་རང་བཞིན་ནམ་མཁའི་སྤྱོད་ཡུལ་ཅན། དེས་སློངས་མོ་བ་དེ་དག་ལ་བུ་གཅིག་པའི་འདུ་ཤེས་བསྐྱེད་པའི་ཕྱིར་རོ། །ཕ་དང་མའི་འདུ་ཤེས་དང་། སྦྱིན་པའི་གནས་ཀྱི་འདུ་ཤེས་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་འདུ་ཤེས་དང་། དཀོན་པའི་འདུ་ཤེས་དང་། དཀའ་བ་བྱེད་པའི་འདུ་ཤེས་དང་། མང་པོ་བྱས་པའི་འདུ་ཤེས་དང་། ཕན་འདོགས་པ་དམ་པའི་འདུ་ཤེས་དང་། བྱང་ཆུབ་ཀྱི་ལམ་ཉེ་བར་སྟོན་པའི་འདུ་ཤེས་དང་། མཁན་པོའི་འདུ་ཤེས་དང་། སྟོན་པའི་འདུ་ཤེས་བསྐྱེད་པའི་ཕྱིར་ཏེ། དེ་ལྟར་དེས་སློངས་མོ་བ་དེ་དག་དོན་ཅི་ལ་འོངས་པ་དང་། དོན་ཅི་ལ་ཕྱིན་པ་དང་། དུས་ཇི་ཙམ་ན་འདུས་པ་དང་། ཡུན་གང་དང་གང་ན་གནས་པ་དང་། དངོས་པོ་ཅི་དང་ཅི་སློང་བ་དང་། རྣམ་པ་གང་འདོད་པ་དང་། བསམ་པ་ཅི་འདྲ་བ་དང་།
en: Because King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa was engaged in undertaking attaining omniscience; he had set out for omniscience; he was turned toward the gateway to omniscience; he was engaged in focusing on bringing satisfaction to all beings; he was intent on practicing entry into the ocean of the qualities of all the buddhas; he was dedicated to destroying the mountain of all the obscurations from māras, karma, and kleśas; he was prepared to respectfully obtain the teachings of all the tathāgatas; from his heart he was dedicated to accumulating completely and totally an ocean of the roots of merit; the continuum of his mind had transcended all attachment; he had no attachment to any sensory object in the world; his field of activity was space, which is the nature of phenomena; he perceived them to be worthy of offerings; he perceived them to be kalyāṇamitras; he perceived them to be rare; he perceived them to be those who do what is difficult; he perceived them to be those who do much; he perceived them to be of the highest benefit; he perceived them to be teachers of the path to enlightenment; he perceived them to be ācāryas; and he perceived them to be teachers.

source: ཅི་དང་ཅི་ལ་སྨོན་པ་དང་། ཅི་དང་ཅི་འདོད་པ་དང་། དངོས་པོ་གང་དང་གང་ཚོལ་བ་དེ་དག་ཐམས་ཅད་ཚུལ་བཞིན་དུ་མི་དགའ་བ་མེད་པའི་བྱམས་པ་ཆེན་པོའི་དཀྱིལ་འཁོར་དང་། སློངས་མོ་པའི་འགྲོ་བ་ལས་ཕྱིན་ཕྱོགས་སུ་མ་བལྟས་པའི་གཏོང་བ་ཆེན་པོའི་འོད་གཟེར་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་སྦྱོར་བའི་གཏོང་བའི་སྒོས་ཡོངས་སུ་ཚིམ་པར་བྱས་སོ། །
en: “In that way, wherever they came from, for whatever reason, whenever they had assembled, however long they had been present, whatever the things they were asking for, whatever their longings, whatever they wished for, whatever they yearned for, whatever they desired, whatever the things they sought, he satisfied those supplicants through the gateway of generosity that was without any disapproval, that had a great range of love, that was not dependent on what the supplicants would do with what they received, that had the light rays of great generosity, and that was united with the equality of all beings.

source: དེས་ཟས་འདོད་པ་ལ་ནི་ཟས་བྱིན་ནོ། །
en: “He gave food to those who wanted food.

source: སྐོམ་འདོད་པ་ལ་ནི་སྐོམ་བྱིན་ནོ། །
en: He gave drink to those who wanted drink.

source: གོས་འདོད་པ་ལ་ནི་གོས་བྱིན་ནོ། །
en: He gave clothes to those who wanted clothes.

source: མེ་ཏོག་འདོད་པ་ལ་ནི་མེ་ཏོག་བྱིན་ནོ། །དེ་བཞིན་དུ་སྤོས་དང་། བདུག་སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: He gave flowers to those who wanted flowers.

source: རིན་པོ་ཆེ་དང་། རྒྱན་དང་། སྟན་དང་། མལ་ཅ་དང་། ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། གཙུག་ལག་ཁང་དང་། བཟའ་ཤིང་གི་ར་བ་དང་། ཀུན་དགའི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། རྟ་དང་གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། རྐང་ཐང་དང་། དགའ་བ་དང་། ཁྱོགས་དང་། བཞོན་པ་དང་། གསེར་དང་། དབྱིག་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། ས་ལེ་སྦྲམ་དང་།
en: In the same way, he gave perfumes, garlands, ointments, powders, robes, parasols, banners, flags, precious materials, jewelry, seats, beds, houses, divine palaces, temples, orchards, parks, forests for ascetics, cavalry, elephants, chariots, infantry, carriages, palanquins, steeds, gold, treasures, jewels, pearls, conches, crystals, corals, gold nuggets, and silver.

source: དངུལ་དག་ཀྱང་བྱིན་པར་གྱུར་ཏོ། །རང་གི་ཁྱིམ་དང་། གཞལ་མེད་ཁང་དང་། བཙུན་མོའི་འཁོར་དང་གཡོག་འཁོར་དང་། རྒྱལ་པོའི་མཛོད་ཐམས་ཅད་ཀྱང་ཕྱེ་སྟེ།
en: “He opened, shared, and gave away all his own dwellings, divine palaces, harem, court, and royal treasures.

source: བགོས་ནས་རབ་ཏུ་བཏང་བར་གྱུར་ཏེ། སུ་ཅི་འདོད་པ་དེ་དག་དེ་ཁྱེར་ཅིག་ཅེས་ནས།
en: He said, ‘Take whatever you want!’

source: ཡུལ་འདོད་པ་དག་ཀྱང་ཡུལ་བྱིན་ནོ། །གྲོང་འདོད་པ་དག་ཀྱང་གྲོང་བྱིན་ནོ། །གྲོང་ཁྱེར་འདོད་པ་དག་ཀྱང་གྲོང་ཁྱེར་བྱིན་ཏེ།
en: If they wanted a land, he gave them a land; if they wanted a city, he gave them a city; if they wanted a town, he gave them a town.

source: སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པར་ཞུགས་པ་དེས་སློངས་མོ་བ་དེ་དག་ཐམས་ཅད་ལ་ཅི་བདོག་པ་ཡོངས་སུ་བཏང་སྟེ། དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་མངོན་པར་སྡུད་དོ།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་བཅུ་གཅིག་པ།
en: Treating all beings equally, he gave away everything he owned to those supplicants, and in giving away everything presented it to them.

source: དེའི་ཚེ་ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཅེས་བྱ་བ་བུ་མོ་དྲུག་ཅུའི་འཁོར་དང་ལྡན་པ། གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོའི་དམ་པ་རྒྱས་པ་དང་ལྡན་པ། མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དང་ལྡན་པ། སྒྲ་མཐོན་ཏིང་དུ་འདུག་པ། མིག་དཀར་ནག་འབྱེས་པ།
en: “At that time, there was a head merchant’s daughter by the name of Ratnaprabhā, who had an entourage of sixty girls and had arrived at the site of the great offering.

source: དྲི་ཞིམ་པོ་ཡིད་དུ་འོང་བ་དང་ལྡན་པ། ཚངས་པའི་དབྱངས་དང་ལྡན་པ། གོས་བཟང་བ། རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་པ། དྲན་པ་དང་བློ་གྲོས་དང་། རིག་པ་དང་ཁྲེལ་ཡོད་པ། དགའ་བ་དང་ངོ་ཚ་ཤེས་པ་དང་། སྤྱོད་པ་དང་ཆ་ལུགས་ཕུན་སུམ་ཚོགས་པ། བླ་མ་ལ་སྲི་ཞུ་དང་ལྡན་པ། ཤེས་བཞིན་གྱི་དམ་པས་སྤྱོད་པ། བྱེད་དགུ་ཟབ་པ། ཆོས་བླང་བ་དང་། གཟུང་བ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཡིད་གཞུངས་པ་དང་ལྡན་པ། སྔོན་དགེ་བའི་རྩ་བ་ལ་ལེགས་པར་བྱས་པ། ཆོས་ཀྱིས་མངོན་པར་བརླན་པའི་སེམས་ཀྱི་རྒྱུད་རབ་ཏུ་དང་བ། དགེ་བའི་བསམ་པ་རྣམ་པར་དག་པ།
en: She was beautiful, attractive, and pretty; she had the most perfectly formed, magnificent color; she was the color of gold; her hair was deep black; her eyes were a contrasting deep black and white; she had a pleasant, beautiful aroma; she had the voice of Brahmā; she wore excellent clothing; she was perfectly adorned in jewelry; she had mindfulness and intelligence; she had joy and a sense of shame; she had perfect conduct and costume; she had respect for the gurus; she acted with perfect mindfulness; she had profound activities; she had received, retained, and comprehended the Dharma; she was honest; she had created excellent roots of merit in the past; the continuum of her mind was clear, as it had been moistened by the Dharma; she had pure, virtuous thoughts; she had a vast aspiration; she had space as her field of activity; she had a mind that rejoiced in benefiting others; she was turned toward the direction of seeing the buddhas; and she aspired to omniscience.

source: མོས་པ་ཡངས་པ། ནམ་མཁའི་སྤྱོད་ཡུལ་ཅན། གཞན་ལ་ཕན་པར་དགའ་བའི་སེམས་དང་ལྡན་པ། སངས་རྒྱས་ལྟ་བའི་ཕྱོགས་ལ་རྣམ་པར་བལྟས་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་མངོན་པར་འདུན་པ་ཞིག་མཆོད་སྦྱིན་གྱི་ར་བ་ཆེན་པོ་དེར་འོངས་ཏེ། ཚོང་དཔོན་གྱི་བུ་མོ་རིན་ཆེན་འོད་ཅེས་བྱ་བ་དེ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པའི་སེང་གེའི་ཁྲི་ཆེན་པོའི་གཡས་རོལ་ཧ་ཅང་ཡང་མྱི་རིང་བ་ཞིག་ན་འདུག་འདུག་སྟེ།
en: “Ratnaprabhā, the head merchant’s daughter, was standing with palms together in homage, not far away, on the right-hand side of the lion throne of King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa.

source: རྒྱལ་པོ་དེ་ལ་ཕྱག་འཚལ་བ་ལས་ཕར་ཅི་ལ་ཡང་ལེན་པ་མེད་དོ། །
en: She bowed down to the king but did not take anything from him.

source: དེ་ཕྱོགས་གཅིག་ན་འདུག་ཅིང་སེམས་འདི་ལྟར་བསྐྱེད་པར་གྱུར་ཏེ། བདག་གིས་དགེ་བའི་བཤེས་གཉེན་འདི་ལྟ་བུ་མཐོང་ཞིང་འགྲོགས་སུ་ཡོད་པ་ནི་བདག་གིས་ཐོབ་པར་བྱ་བ་ལེགས་པར་ཐོབ་པོ་སྙམ་སྟེ།
en: Then she went to one side and thought, ‘That I have been able to see and to be with this kind of kalyāṇamitra is an excellent attainment.’

source: དེས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེ་ལ་དགེ་བའི་བཤེས་གཉེན་གྱི་འདུ་ཤེས་དང་། སྟོན་པའི་འདུ་ཤེས་དང་སྙིང་བརྩེ་བར་བྱེད་པའི་འདུ་ཤེས་དང་། ཕན་འདོགས་པའི་འདུ་ཤེས་དང་། སངས་རྒྱས་ཀྱི་འདུ་ཤེས་བསྐྱེད་དེ།
en: “She perceived King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa to be a kalyāṇamitra, perceived him to be a teacher, perceived him to be compassionate, perceived him to be someone who benefits others, and perceived him to be a buddha.

source: གཡོ་སྒྱུ་མེད་པའི་སེམས་ཀྱིས་དགའ་བ་དང་མོས་པ་དང་། སྤྲོ་བའི་ཤུགས་རབ་ཏུ་ཡངས་པ་ཐོབ་པས། རང་གི་རྒྱན་རྣམས་ལུས་ལས་བཀྲོལ་ཏེ། རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་གང་ན་བ་དེར་མངོན་པར་བལྟས་ཏེ། གཏོར་བ་དང་དེ་དག་དེའི་སེང་གེའི་ཁྲིའི་འོག །
en: “She attained the power of joy, aspiration, and enthusiasm, and with a mind that was free of dissimulation, she removed her jewelry and, gazing at King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa, threw it toward him, scattering it on the platform at the foot of the lion throne.

source: ཁྲི་འཕང་གི་སའི་སྟེང་དུ་གྲམ་པར་གྱུར་ཏོ། །དེའི་རྒྱན་དེ་དག་དེ་ལྟར་གཏོར་ནས་སྨོན་ལམ་བཏབ་པ། ཇི་ལྟར་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་འདི་སེམས་ཅན་མགོན་མེད་ཅིང་མུན་པའི་ནང་ན་འཐོམས་པ་རྣམས་ཀྱི་མགོན་སྐྱབས་སུ་གྱུར་པ་དེ་ལྟར་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་འགྱུར་བར་ཤོག་ཤིག །
en: When she had in that way scattered her jewelry, she made this prayer: ‘May I in the future become the same as King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa, who is a refuge for beings who have no protector and are enveloped in darkness.

source: འདིས་ཆོས་གང་ཤེས་པ་དེ་དག་ཀྱང་བདག་གིས་ཀྱང་ཤེས་པར་ཤོག་ཤིག །
en: May I know whatever Dharma he knows.

source: འདི་ཐེག་པ་གང་གིས་འབྱུང་བ་དེས་བདག་ཀྱང་འབྱུང་བར་ཤོག་ཤིག །
en: May I set forth through whatever yāna he has set forth.

source: འདི་ལམ་གང་ནས་ཞུགས་པ་དེ་ནས་བདག་ཀྱང་འཇུག་པར་ཤོག་ཤིག །ཇི་ལྟར་འདི་གཟུགས་བལྟ་ན་བཏང་མི་བྲལ་ཟད་མི་ཤེས་པའི་ལོངས་སྤྱོད་དང་ལྡན་ཏེ། གཡོག་འཁོར་མཐའ་ཡས་ལ་གཞན་གྱིས་མི་ཐུབ་ཅིང་ཐུབ་པར་དཀའ་སྟེ། ཐུབ་པ་མེད་པ་དེ་བཞིན་བདག་ཀྱང་ཤོག་ཤིག །
en: May I follow whatever path he has followed; may I become just like him whose body gives unending pleasure when gazed upon, who has a limitless entourage and is undefeatable, invincible, and unconquerable.

source: འདི་གང་དང་གང་དུ་སྐྱེ་བར་འགྱུར་བ་དེ་དང་དེར་བདག་ཀྱང་སྐྱེ་བར་འགྱུར་བར་ཤོག་ཤིག །
en: Wherever he is born, may I also be reborn there.’

source: སྙམ་པ་དང་དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པ། རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས་ཤེས་ནས་དེ་ལ་བལྟས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་ཁྱོད་ལ་ཅི་དགོས་པ་ཁྱེར་ཅིག །
en: “King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa knew what her mind was focused on and engaged with, and he said to her, ‘Girl, take whatever you need!

source: བུ་མོ་ང་ནི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་སྟེ།
en: Girl, I am giving away all my possessions.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱ་བ་ལ་ཞུགས་པའོ། །དེ་སྐད་ཅེས་བྱས་པ་དང་།
en: I am engaged in satisfying all beings.’

source: དེའི་ཡིད་ལ་ཡང་བདག་ནི་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས་ཐུགས་སུ་ཆུད་པར་གྱུར་ཏོ། །སྙམ་ནས་དེ་བས་ཀྱང་མོས་པར་གྱུར་ཏོ། །
en: “She thought, ‘King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa has understood me,’ and gained an even greater faith in him.

source: དེ་དེ་ལྟར་མོས་པའི་སེམས་སུ་གྱུར་ཏེ། དགེ་བའི་རྩ་བ་ཡངས་ཤིང་རྒྱ་ཆེ་བའི་ཤུགས་ཡོངས་སུ་སྐྱེས་ནས་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སྔོན་ཅད་ས་ལས་རྣམ་བརྒྱན་སྤྲིན་འདི་ནི། །རྒྱལ་པོ་སེང་གེ་ཁྱོད་འཁྲུངས་མ་གྱུར་ཚེ། །མདངས་དཀར་མ་གྱུར་གཟི་བརྗིད་མ་མཆིས་ཏེ། །
en: With that faith in him, giving rise to the power of immense vast roots of merit, she recited these verses to King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa: “ ‘In the past, in Sāla­vyūha­megha, Before you, the lion king, were born, There was no delight, no magnificence.

source: ཡི་དགས་འཇིགས་པའི་གནས་དང་ཅི་མི་འདྲ། །
en: It was like the dreadful land of the pretas.

source: མི་དག་ཀུན་ཀྱང་སྲོག་གཅོད་མོས་པར་གྱུར། །
en: {22} “ ‘All the people wished to kill.

source: མ་བྱིན་ལེན་ལ་ཚུལ་དང་སྦྱོར་མ་མཆིས། །
en: They stole and acted inappropriately.

source: བརྫུན་དུ་སྨྲ་ཞིང་བརླང་བའི་ཚིག་ཀྱང་བརྗོད། །ཕྲ་མ་ཁྱལ་བའི་ཚིག་ཀྱང་རབ་ཏུ་སྨྲ། །
en: They told lies and spoke harshly And spoke slanderous and meaningless words.

source: གཞན་གྱི་ནོར་ལ་ཆགས་པའི་སེམས་དང་ལྡན། །
en: {23} “ ‘They had minds that craved the wealth of others.

source: གང་ཟག་གཞན་ལ་ཀུན་ཀྱང་ངན་དུ་སེམས། །
en: They thought maliciously of all other people.

source: ལྟ་བའི་རྣམ་གནས་སྡིག་ཏོའི་སྤྱོད་ཡུལ་ཅན། །
en: They had wrong views and a field of sinful activity.

source: ལོག་པའི་སྦྱོར་བས་ངན་པའི་འགྲོ་བར་ལྷུང་། །ཆོས་ངན་ཆོས་ལ་སྤྱོད་པའི་མྱིའི་རྣམས། །
en: Through misleading practices they fell into the lower existences.

source: མ་རིག་གཏི་མུག་མུན་པས་བསྒྲིབས་པ་དག །ལྟ་བ་ལོག་ཞུགས་ཕྱིན་ཅི་ལོག་མཐོང་བས། །དགུང་ལོ་མང་པོར་དགུང་ཆར་བབ་མ་གྱུར། །དགུང་ཆར་མ་བབ་ས་བོན་ཆབ་འཚལ་ཏེ། །
en: {24} “ ‘The people practiced what was not Dharma, Obscured by the darkness of ignorance and stupidity, Following wrong views, and having heretical viewpoints, And therefore for many years the rains did not fall.

source: ལོ་ཐོག་མི་འཁྲུངས་ཞུགས་ཤིང་འཁྲུངས་མ་གྱུར། །མཚོ་དང་ལུ་མ་ཆུ་ཕྲན་རྒྱུད་ཀྱང་སྐམས། །ནགས་ཚལ་རྩི་ཤིང་ཀུན་ཀྱང་དེ་བཞིན་ཏེ། །
en: {25} “ ‘When the rains did not fall, seeds died, The harvests did not grow, trees did not grow, Lakes, ponds, and streams dried up, And it was the same for all the forests and plants.
